/**
 * Ctrl模板文件，所有controller文件都以该文件作为最基本的格式
 */

(function() {
    var controller = angular.module('app.controller');

    controller.controller('TmplCtrl', ['$scope', function TmplCtrl($scope) {

        /*========== Widget Events ==================================================*/

        /*========== Scope Models ==================================================*/

        /*========== Scope Functions ==================================================*/

        /*========== Listeners ==================================================*/

        /*========== Watches ==================================================*/

        /*========== Private Functions ==================================================*/

    }]);

})();

